export const agreeItems = [
  {
    id: 1,
    isChecked: false,
    isExpanded: false,
    title: '서비스 이용약관',
    content: `# RoomE 서비스 이용약관

## 제1조 (목적)
본 약관은 RoomE(이하 "회사")가 제공하는 서비스의 이용과 관련하여 회사와 이용자 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.

## 제2조 (정의)
1. "서비스"란 회사가 제공하는 모든 서비스를 의미합니다.
2. "이용자"란 본 약관에 따라 회사가 제공하는 서비스를 이용하는 회원 및 비회원을 말합니다.
3. "회원"이란 회사에 개인정보를 제공하고 회원등록을 한 자로서, 회사의 정보를 지속적으로 제공받으며 회사가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
4. "비회원"이란 회원에 가입하지 않고 서비스를 이용하는 자를 말합니다.
5. "계정정보"란 이용자의 회원가입 시 기재한 정보, 서비스 이용 시 발생하는 정보 등을 통칭합니다.

## 제3조 (약관의 효력 및 변경)
1. 본 약관은 서비스를 이용하고자 하는 모든 이용자에게 적용됩니다.
2. 회사는 필요한 경우 관련법령을 위배하지 않는 범위에서 본 약관을 변경할 수 있습니다.
3. 회사가 약관을 변경할 경우에는 적용일자 및 변경사유를 명시하여 서비스 내에 공지합니다.
4. 변경된 약관은 공지된 적용일자로부터 효력이 발생합니다.
5. 이용자는 변경된 약관에 동의하지 않을 경우 서비스 이용을 중단하고 회원 탈퇴를 요청할 수 있습니다. 변경된 약관의 효력 발생일 이후에도 서비스를 계속 이용하는 경우 약관의 변경사항에 동의한 것으로 간주됩니다.

## 제4조 (서비스의 내용)
1. 회사는 다음과 같은 서비스를 제공합니다:
   1) **도서 관리 서비스**  
      - 사용자가 자신의 방에서 책장에서 도서를 추가하고, 서평을 작성하며 관리할 수 있는 기능 제공  

   2) **음악 감상 서비스**  
      - 음악을 추가하고, 이에 대한 가벼운 감상평 및 댓글을 남길 수 있는 기능 제공  

   3) **방 테마 및 포인트 시스템**  
      - 사용자가 포인트를 사용하여 방의 테마를 구매 및 변경할 수 있음  
      - 추가적인 포인트는 결제를 통해 충전 가능  

   4) **소셜 연결 기능**  
      - 나와 비슷한 취향을 가진 하우스메이트(룸메이트)를 찾고 연결할 수 있는 서비스 제공  

   5) **랭킹 시스템**  
      - 사용자 활동에 따라 점수를 부여하고, 이를 합산하여 랭킹 제도를 운영  

   6) **주거 관련 커뮤니티 서비스**  
      - 이용자 간 소통 및 정보 공유를 위한 커뮤니티 기능 제공  

   7) **기타 회사가 추가 개발하거나 제휴 계약 등을 통해 이용자에게 제공하는 일체의 서비스**  

2. 회사는 필요한 경우 서비스의 내용을 변경할 수 있으며, 변경 사항은 서비스 내에 공지합니다.
3. 회사는 시스템 점검, 보수, 교체 등의 이유로 서비스를 일시 중단할 수 있으며, 이러한 경우 사전에 공지합니다. 단, 불가항력적인 사유로 인한 중단의 경우에는 사후 공지할 수 있습니다.

## 제5조 (서비스 이용계약의 성립)
1. 서비스 이용계약은 이용자가 본 약관에 동의하고, 회사가 정한 절차에 따라 서비스 이용 신청을 하면 회사가 이를 승낙함으로써 성립됩니다.
2. 이용자는 회사가 요청하는 정보를 정확하게 제공해야 하며, 허위 정보 제공으로 인한 불이익은 이용자의 책임입니다.
3. 회사는 다음 각 호에 해당하는 신청에 대해서는 승낙을 하지 않을 수 있습니다:
   - 기술상 서비스 제공이 불가능한 경우
   - 실명이 아니거나 타인의 명의를 사용하는 경우
   - 허위의 정보를 기재하거나, 회사가 요청하는 내용을 기재하지 않은 경우
   - 이용자가 이전에 이용약관 위반 등의 사유로 서비스 이용이 중지되거나 해지된 경험이 있는 경우
   - 기타 이용신청자의 귀책사유로 인하여 승낙이 불가능한 경우
4. 미성년자가 서비스를 이용하기 위해서는 법정대리인의 동의를 얻어야 합니다.
      `,
  },
  {
    id: 2,
    isChecked: false,
    isExpanded: false,
    title: '개인정보 수집/이용 문의',
    content: `# RoomE 개인정보 수집/이용 안내

## 제1조 (개인정보 수집 및 이용 목적)
RoomE(이하 "회사")는 다음의 목적을 위하여 개인정보를 처리합니다.  
처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며,  
이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라  
별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

1. **서비스 제공**  
   1) 도서 및 음악 관리 서비스 제공
   2) 맞춤형 콘텐츠 및 추천 서비스 제공
   3) 방 테마 및 포인트 시스템 운영
   4) 본인인증, 연령확인  
   5) 랭킹 및 리워드 시스템 운영
   6) 불량 이용자 관리 및 부정 이용 방지

2. **회원관리**  
   1) 회원제 서비스 이용에 따른 본인확인  
   2) 개인식별  
   3) 불량회원의 부정이용 방지  
   4) 가입의사 확인  
   5) 불만처리 등 민원처리  
   6) 고지사항 전달  


## 제2조 (수집하는 개인정보 항목)
회사는 서비스 제공을 위해 다음과 같은 개인정보를 수집합니다.

1. **필수항목**  
   1) 성명,  이메일 주소, 아이디, 비밀번호  
   2) 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보  



## 제3조 (개인정보의 보유 및 이용기간)
회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터  
개인정보를 수집 시에 동의 받은 개인정보 보유·이용기간 내에서  
개인정보를 처리·보유합니다.

1. **회원가입 정보**  
   1) 보존 항목: 성명, 연락처, 이메일 주소 등 회원정보  
   2) 보존 기간: 회원 탈퇴 시까지  
   3) 단, 관계 법령에 따라 일정 기간 보존이 필요한 경우 해당 기간 동안 보관  

2. **서비스 이용 기록**  
   1) 보존 항목: 방문 기록, 서비스 이용 기록  
   2) 보존 기간: 6개월  


## 제4조 (개인정보의 파기절차 및 방법)
회사는 개인정보 보유기간의 경과, 처리목적 달성 등  
개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.

1. **파기절차**  
   1) 이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다.  
   2) 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.  

2. **파기방법**  
   1) 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.  
   2) 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.  


## 제5조 (이용자 및 법정대리인의 권리와 그 행사방법)
1. 이용자는 회사에 대해 언제든지 개인정보 열람, 정정, 삭제, 처리정지 요구 등의 권리를 행사할 수 있습니다.  
2. 이용자의 개인정보 조회, 수정을 위해서는 '개인정보변경'(또는 '회원정보수정' 등)을, 가입해지(동의철회)를 위해서는 '회원탈퇴'를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.  
3. 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다.  
4. 만 14세 미만 아동의 경우, 법정대리인이 아동의 개인정보를 조회하거나 수정할 권리, 수집 및 이용 동의를 철회할 권리를 가집니다.  
      `,
  },
];
export const ACCESS_MAX_AGE = 3540; // 실제로는 1분남았을때 만료 예정
export const REFRESH_MAX_AGE = 1209600;
